[
  {
    "id": 0,
    "imdb": 6.5,
    "title": "Žvaigždžių karai: epizodas I – pavojaus šešėlis",
    "date": 1999,
    "duration": "133 min",
    "director": "George Lucas",
    "genre": "Fantastinis",
    "actors": [
      "Liam Neeson",
      "Ewan McGregor",
      "Natalie Portman",
      "Jake Lloyd",
      "Ian McDiarmid",
      "Ahmed Best",
      "Pernilla August",
      "Kenny Baker",
      "Anthony Daniels",
      "Frank Oz",
      "Ray Park",
      "Samuel L. Jackson"
    ],
    "about": "Pavojaus šešėlio biudžetas buvo 115 milijonų JAV dolerių. Filmuota daugiausia „Leavesden“ studijoje Didžiojoje Britanijoje. Tatuino scenos filmuotos Tunise, Nabu rūmų vidus – Italijoje. Filmavimo darbai prasidėjo 1997 m. liepos 26 d., baigėsi rugsėjo 30 d. Filmas buvo labai laukiamas, tačiau nemažai gerbėjų ir kritikų juo nusivylė. „Pavojaus šešėlis“ stulbino savo specialiaisiais efektais, kurių buvo apie pora tūkstančių, tačiau tais metais Oskarą už efektus laimėjo „Matrica“. Daug kas kritikavo režisūrą, Natalie Portman ir Jake’o Lloydo vaidybą, scenarijų. Ypač kritikuotas Džar Džar Binksas, kurį daugelis senųjų „Žvaigždžių karų“ gerbėjų laikė komerciniu. Ne visiems pasirodė įtikinama, kad Anakinas pats sukonstravo C-3PO, taip pat ginčytina buvo „midichlorianų“ idėja. Nepaisant kritikos, „Pavojaus šešėlis“ buvo labai populiarus, uždirbo 493 milijonus dolerių už Amerikos ribų ir 431 mln. dolerių Amerikoje. Filmo pavadinimas nevienprasmis. Paprastai manoma, kad jis yra aliuzija į Dartą Sidijų arba Situs. Kita vertus, tai taip pat galėtų būti užuomina į būsimąjį Anakino virtimą Dartu Veideriu. Dar viena teorija skelbia, kad pagrindinis „pavojus“ filme – Federacijos invazija į Nabu – išties tėra „fantomas“, šmėkla – politinio Darto Sidijaus žaidimo dalis. Taigi Prekybos Federacija tebuvo šešėlinis pavojus, o Palpatinas – tikrasis."
  },
  {
    "id": 1,
    "imdb": 6.6,
    "title": "Žvaigždžių karai: epizodas II – klonų ataka",
    "date": 2002,
    "duration": "142 min",
    "director": "George Lucas",
    "genre": "Fantastinis",
    "actors": [
      "Ewan McGregor",
      "Natalie Portman",
      "Hayden Christensen",
      "Ian McDiarmid",
      "Christopher Lee",
      "Ahmed Best",
      "Pernilla August",
      "Kenny Baker",
      "Anthony Daniels",
      "Frank Oz",
      "Samuel L. Jackson"
    ],
    "about": "Pagrindiniai filmavimo darbai vyko 20th Century Fox studijose Australijoje, taip pat Tuniso dykumose, Ispanijoje ir Italijoje nuo 2000 m. liepos 26 d. iki rugsėjo 20 d. Buvo giriamos filmo veiksmo scenos bei specialieji efektai, tačiau kritikuoti personažai ir dialogai. Nemažai kritikos kliuvo aktoriams, ypač Christensenui ir Portman. Filmas uždirbo 684,2 mln. JAV dolerių visame pasaulyje. Tai buvo vienintelis Žvaigždžių karų sagos filmas, kuris netapo pelningiausių metų filmu. Klonų ataką pralenkė Žmogus voras ir Žiedų valdovas – dvi tvirtovės."
  },
  {
    "id": 2,
    "imdb": 7.6,    
    "title": "Žvaigždžių karai: epizodas III – sitų kerštas",
    "date": 205,
    "duration": "140 min",
    "director": "George Lucas",
    "genre": "Fantastinis",
    "actors": [
      "Liam Neeson",
      "Ewan McGregor",
      "Natalie Portman",
      "Jake Lloyd",
      "Ian McDiarmid",
      "Ahmed Best",
      "Pernilla August",
      "Kenny Baker",
      "Anthony Daniels",
      "Frank Oz",
      "Ray Park",
      "Samuel L. Jackson"
    ],
    "about": "Filmo premjera įvyko Kanų kino festivalio nekonkursinėje programoje, 2005 m. gegužės 15 d. Daugelyje kitų šalių jis pradėtas rodyti gegužės 19 d. Sitų kerštas buvo pirmasis ir vienintelis Žvaigždžių karų sagos filmas, kuriam taikytas PG-13 apribojimas (Kai kas netinkama vaikams iki 13 metų – įspėjimas tėvams). Visi ankstesni filmai buvo žymimi PG (Rekomenduojama tėvų priežiūra). Kritikai į filmą reagavo entuziastingiau nei į kitus du naujosios trilogijos filmus. Kai kurių nuomone, tai – geriausias naujas Žvaigždžių karų filmas. Nemažai kritikos teko filmo dialogams, ypač meilės scenoms. Taip pat kritikuota vaidyba, specialiųjų efektų perteklius, siužeto skylės. Visame pasaulyje Sitų kerštas uždirbo 848 797 674 JAV dolerius."
  },
  {
    "id": 3,
    "imdb": 8.3,
    "title": "Žvaigždžių karai: epizodas IV – nauja viltis",
    "date": 1977,
    "duration": "133 min",
    "director": "George Lucas",
    "genre": "Fantastinis",
    "actors": [
      "Mark Hamill",
      "Harrison Ford",
      "Carrie Fisher",
      "Alec Guinness",
      "David Prowse",
      "James Earl Jones",
      "Anthony Daniels",
      "Kenny Baker",
      "Peter Mayhew"
    ],
    "about": "Lukasas neslėpė, kad įkvėpimo Žvaigždžių karams sėmėsi iš įvairių šaltinių. Tarp jų yra Akiros Kurosavos filmas Paslėpta tvirtovė, Franko Herberto Kopos serija, Leni Riefenstahl „Valios triumfas“, Kubriko „2001: Kosminė odisėja“ ir kt. filmai, knygos bei realūs įvykiai (pvz., Antrojo pasaulinio karo įtaka naikintuvų, pilotų uniformų išvaizdai). Nauja viltis buvo itin komerciškai sėkmingas filmas, nors prodiuseris ir platintojai iš pradžių į Lukaso sumanymą žiūrėjo skeptiškai. Filmui pasirodžius 1977 m. jis vadinosi tiesiog Žvaigždžių karai, tačiau 1980 m. tęsinys Imperija kontratakuoja pasirodė su epizodo numeriu. Po metų pirmieji Žvaigždžių karai vėl išleisti į ekranus, šįkart su epizodo numeriu ir pavadinimu Nauja viltis. Toks pavadinimas pakeitė ankstesnįjį ir įžanginiuose į ekrano gilumą slenkančiuose titruose."
  },
  {
    "id": 4,
    "imdb": 8.8,
    "title": "Žvaigždžių karai: epizodas V – imperija kontratakuoja",
    "date": 1980,
    "duration": "127 min",
    "director": "Irvin Kershner",
    "genre": "Fantastinis",
    "actors": [
      "Mark Hamill",
      "Harrison Ford",
      "Carrie Fisher",
      "Alec Guinness",
      "David Prowse",
      "James Earl Jones",
      "Anthony Daniels",
      "Kenny Baker",
      "Peter Mayhew",
      "Billy Dee Williams",
      "Frank Oz",
      "Clive Revill",
      "Ian McDiarmid"
    ],
    "about": "Filmas Imperija kontratakuoja filmuotas 1979 m. nuo kovo 5 d. iki rugsėjo 24 d. Dalis Hoto scenų filmuota Norvegijoje. Dagobos, Debesų miesto ir Hoto bazės scenos filmuotos Londone esančioje Elstree studijoje. 2003 m., kuriant „Sitų kerštą, Lukasas papildomai nufilmavo Ian McDiarmidą scenai su Imperatoriumi Palpatinu. Reakcija į filmą buvo įvairi. Kai kurie kritikai gyrė techninius pasiekimus, kitiems nepatiko siužetas. Vėliau daug Žvaigždžių karų gerbėjų laikė Imperiją stipriausiu iš visų sagos filmų: čia geresnė vaidyba, režisūra, filmas vizualiai ekspresyvesnis."
  },
  {
    "id": 5,
    "imdb": 8.3,
    "title": "Žvaigždžių karai: epizodas VI – džedajaus sugrįžimas",
    "date": 1983,
    "duration": "135 min",
    "director": "R. Marquand",
    "genre": "Fantastinis",
    "actors": [
      "Mark Hamill",
      "Harrison Ford",
      "Carrie Fisher",
      "Alec Guinness",
      "David Prowse",
      "James Earl Jones",
      "Anthony Daniels",
      "Kenny Baker",
      "Peter Mayhew",
      "Billy Dee Williams",
      "Frank Oz",
      "Ian McDiarmid",
      "Jeremy Bulloch"
    ],
    "about": "Manoma, kad Džordžas Lukasas prisidėjo prie Džedajaus sugrįžimo režisavimo tiek daug, kad gali būti laikomas antruoju režisieriumi. Kai kurie kritikai pastebėjo, kad Lukaso ir Marquando režisūros stiliai labai skirtingi. Marquandas buvęs daug ortodoksiškesnis. Pirmasis filmo pavadinimas buvo Džedajaus kerštas, tačiau Lukasas nusprendė, kad džedajui kerštauti nebūdinga. Filmuojant darbinis projekto pavadinimas buvo Blue Harvest (Mėlynasis derlius), o filmas – Horror Beyond Imagination (Neįsivaizduojamas siaubas), kad būtų nuslėpta, kas iš tikrųjų kuriama. Lukasas buvo jau visai savarankiškas ir nepriklausomas nuo Holivudo sistemos. Kritikų ir gerbėjų Džedajaus sugrįžimas dažnai laikomas silpniausiu pirmosios trilogijos filmu. Nors veiksmo scenos giriamos, gerbėjai priekaištauja Lukasui, kad gan primityvią evokų gentelę padarė galinčią nugalėti iki dantų ginkluotas imperines pajėgas. Kiti gerbėjai evokus mėgsta būtent už jų išradingumą ir ryžtą."
  },
  {
    "id": 6,
    "imdb": 8.0,
    "title": "Žvaigždžių karai: epizodas VII – galia nubunda",
    "date": 2015,
    "duration": "135 min",
    "director": "J. J. Abrams",
    "genre": "Fantastinis, Nuotykių",
    "actors": [
      "Harrison Ford",
      "Mark Hamill",
      "Carrie Fisher",
      "Adam Driver",
      "Daisy Ridley",
      "John Boyega",
      "Oscar Isaac",
      "Lupita Nyong'o",
      "Lupita Nyong'o",
      "Domhnall Gleeson",
      "Anthony Daniels",
      "Peter Mayhew",
      "Max von Sydow"
    ],
    "about": "Žvaigždžių karų sagos filmas, režisuotas Džefrio Džeikobo Abramso. Ilgai lauktas filmas kino ekranuose pasirodė 2015 m., visi bilietai į premjerą buvo masiškai išpirkti pačią pirmą dieną. Septintoji Žvaigždžių karų dalis pasiekė bilietų pardavimų kasose rekordų, tai pelningiausias frančizės filmas, taip pat daugiausiai lėšų surinkęs filmas Šiaurės Amerikoje ir apskritai trečias pelningiausias visų laikų filmas, pasauliniu mastu surinkęs daugiau kaip 2 mlrd. JAV dolerių."
  }
]
